{"0": "The unit root hypothesis is examined allowing a possible one-time change in the level or in the slope of the trend function. When fluctuations are stationary around a breaking trend function, standard tests cannot reject the unit root, even asymptotically. Consistent tests are derived and applied to the Nelson-Plosser data set (allowing a change in level for the 1929 crash) and to the postwar quarterly real GNP series (allowing a change in slope after 1973). The unit root hypothesis is rejected at a high confidence level for most series. Fluctuations are stationary. The only persistent \"shocks\" are the 1929 crash and the 1973 oil price shock. Copyright 1989 by The Econometric Society.\nCollapse", "1": "We evaluate the relative importance of COVID-19 infections and oil price news in influencing oil prices. We show that when the number of new COVID-19 infections surpasses 84,479, COVID-19 exerts a bigger effect on oil prices. Oil price news when conditioned on COVID-19 cases have limited effects on price. When oil price volatility is used as a threshold, at higher levels of volatility, both COVID-19 cases and negative oil price news influence oil prices.\nCollapse", "2": "In this paper, we study the evolution of hourly oil price volatility. Using multiple measures of oil price volatility, we conclude that volatility increased following the onset of COVID-19. After controlling for conventional predictors of oil price volatility, we show that COVID-19 cases and deaths led to an increase in daily oil price volatility by between 8% and 22%. Our results pass a battery of robustness tests.\nCollapse", "3": "Recently, Perron has carried out tests of the unit-root hypothesis against the alternative hypothesis of trend stationarity with a break in the trend occurring at the Great Crash of 1929 or at the 1973 oil-price shock. His analysis covers the Nelson–Plosser macroeconomic data series as well as a postwar quarterly real gross national product (GNP) series. His tests reject the unit-root null hypothesis for most of the series. This article takes issue with the assumption used by Perron that the Great Crash and the oil-price shock can be treated as exogenous events. A variation of Perron's test is considered in which the breakpoint is estimated rather than fixed. We argue that this test is more appropriate than Perron's because it circumvents the problem of data-mining. The asymptotic distribution of the estimated breakpoint test statistic is determined. The data series considered by Perron are reanalyzed using the test static. The empirical results make use of the asymptotics developed for the test statistic as well as extensive finite-sample corrections obtained by simulation. The effect on the empirical results of fat-tailed and temporally dependant innovations is investigated. In brief, by treating the breakpoint as endogenous, we find that there is less evidence against the unit-root hypothesis than Perron finds for many of the data series but stronger evidence against if for several of the series, including the Nelson–Plosser industrial-production, nominal-GNP, and real-GNP series.\nCollapse", "4": "Coronavirus (COVID-19) creates fear and uncertainty, hitting the global economy and amplifying the financial markets volatility. The oil price reaction to COVID-19 was gradually accommodated until March 09, 2020, when, 49 days after the release of the first coronavirus monitoring report by the World Health Organization (WHO), Saudi Arabia floods the market with oil. As a result, international prices drop with more than 20% in one single day. Against this background, the purpose of this paper is to investigate the impact of COVID-19 numbers on crude oil prices, while controlling for the impact of financial volatility and the United States (US) economic policy uncertainty. Our ARDL estimation shows that the COVID-19 daily reported cases of new infections have a marginal negative impact on the crude oil prices in the long run. Nevertheless, by amplifying the financial markets volatility, COVID-19 also has an indirect effect on the recent dynamics of crude oil prices.\nCollapse", "5": "This study focuses on the relation between stock price returns and oil price returns covering the COVID-19 period. This relation is examined for major net oil-importing Asian countries. Utilizing daily data, we fit a DCC-GARCH model. We find evidence of a positive co-movement between oil price returns and stock price returns during the COVID-19 period. This indicates that falling oil prices act as a negative signal for the stock market.\nCollapse", "6": "Using a newly developed measure of global real economic activity, a structural decomposition of the real price of crude oil in four components is proposed: oil supply shocks driven by political…\nExpand", "7": "The paper proposes modification of auto-regressive integrated moving average model for finding the parameters of estimation and forecasts using exponential smoothing. The study use data Brent crude…\nExpand", "10": "The unit root hypothesis is examined allowing a possible one-time change in the level or in the slope of the trend function. When fluctuations are stationary around a breaking trend function, standard tests cannot reject the unit root, even asymptotically. Consistent tests are derived and applied to the Nelson-Plosser data set (allowing a change in level for the 1929 crash) and to the postwar quarterly real GNP series (allowing a change in slope after 1973). The unit root hypothesis is rejected at a high confidence level for most series. Fluctuations are stationary. The only persistent \"shocks\" are the 1929 crash and the 1973 oil price shock. Copyright 1989 by The Econometric Society.\nCollapse"}